describe("Тест", function () {
  
  // Mocha обикновенно изчаква тестовете 2 секунди преди да ги счита като грешни

  this.timeout(200000); // С този код увеличаваме това - в този случая на 200 000 милисекунди
  
  // Това е заради "alert" функцията, тъй като ако се забавите да натиснете "OK" бутона тестовете няма да минат!

  before(() => alert("Тестването стартира – преди всички тестове"));
  after(() => alert("Тестването завърши – след всички тестове"));

  beforeEach(() => alert("Преди теста – влизаме в теста"));
  afterEach(() => alert("След теста – излизаме от теста"));

  it("Тест 1", () => alert("Това е: Тест 1"));
  it("Тест 2", () => alert("Това е: Тест 2"));
});
